Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/hw_config.c
/**
 Copyright (c) 2015 MidAir Technology, LLC.  All rights reserved.

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation, either
 version 3 of the License, or (at your option) any later version.

 This program is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 Lesser General Public License for more details.

 You should have received a copy of the GNU Lesser General Public
 License along with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include <string.h>
#include "module_info.h"
#include "flash.h"
#undef STATIC_ASSERT
#include "hw_config.h"
#include "sst25vf_spi.h"
#include "data_management_layer.h"
#include "socket_manager.h"
#include "debug.h"
#include "rgbled.h"
#include "device_manager.h"
#include "pstorage.h"
#include "ble_radio_notification.h"
#include "ble_conn_params.h"
#include "ble_hci.h"
#include "custom_data_service.h"
#include "info_data_service.h"
#include "nrf_drv_wdt.h"
#include "client_handling.h"
#include "app_timer.h"

uint32_t NbrOfPage = 0;
uint16_t Flash_Update_Index = 0;
uint32_t External_Flash_Address = 0;
uint32_t External_Flash_Start_Address = 0;

// static void blink_led(int count)
// {
//     for (int i = 0; i < count; i++) {
//         nrf_gpio_pin_set(0);
//         nrf_delay_us(250000);
//         nrf_gpio_pin_clear(0);
//         nrf_delay_us(250000);
//     }
//     nrf_delay_us(500000);
// }

static void blink_led(int count)
{
	for (int i = 0; i < count; i++) {
		nrf_gpio_pin_set(GATEWAY_NOTIFICATION_LED);
		nrf_delay_us(100000);
		nrf_gpio_pin_clear(GATEWAY_NOTIFICATION_LED);
		nrf_delay_us(100000);
	}
	// nrf_delay_us(300000);
	nrf_delay_us(100000);
}

void tick_system_seconds(void)
{
    system_seconds++;
}

uint32_t get_system_seconds(void)
{
    return system_seconds;
}

uint32_t system_millis(void)
{
    return (( (((uint64_t)RTC_OVERFLOW_COUNT << 24) | (uint64_t)NRF_RTC1->COUNTER) * 1.0 ) / (APP_TIMER_CLOCK_FREQ * 1.0)) * 1000.0;
}

uint32_t system_micros(void)
{
    return (( (((uint64_t)RTC_OVERFLOW_COUNT << 24) | (uint64_t)NRF_RTC1->COUNTER) * 1.0 ) / (APP_TIMER_CLOCK_FREQ * 1.0)) * 1000000.0;
}

/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    // blink_led(5);

    DEBUG("Hit an app error of code %d", error_code);
    DEBUG("Error happened on line number %d in file %s", line_num, p_file_name);

    char msg[64];
  	snprintf(msg, 64, "\n^^^^^^^^ Hit an app error of code = 0x%08X\n", (int)error_code);
  	debugHelper(msg);
  	// snprintf(msg, 64, "Error happened on line number %lu in file %s", (unsigned long)line_num, p_file_name);
  	// debugHelper(msg);

    // LED_SetRGBColor(RGB_COLOR_RED);
		//
    // nrf_drv_wdt_channel_feed(m_channel_id);
    // //this will stop all timers, so we need to feed the WDT here
    // for (int i=0; i<APP_TIMER_MAX_TIMERS; i++) app_timer_stop(i);
		//
    // nrf_gpio_pin_set(0);
    // for (int count = 0; count < 2; count++) {
    //     //SOS Call
    //     for (int i = 0; i < 3; i++) {
    //         LED_On(LED_RGB);
    //         nrf_delay_ms(100);
    //         LED_Off(LED_RGB);
    //         nrf_delay_ms(100);
    //         nrf_drv_wdt_channel_feed(m_channel_id);
    //     }
    //     nrf_delay_ms(250);
    //     for (int i = 0; i < 3; i++) {
    //         LED_On(LED_RGB);
    //         nrf_delay_ms(250);
    //         LED_Off(LED_RGB);
    //         nrf_delay_ms(250);
    //         nrf_drv_wdt_channel_feed(m_channel_id);
    //     }
    //     nrf_delay_ms(250);
    //     for (int i = 0; i < 3; i++) {
    //         LED_On(LED_RGB);
    //         nrf_delay_ms(100);
    //         LED_Off(LED_RGB);
    //         nrf_delay_ms(100);
    //         nrf_drv_wdt_channel_feed(m_channel_id);
    //     }
    //     nrf_delay_ms(1000);
    //     for (int i = 0; i < error_code; i++) {
    //         LED_On(LED_RGB);
    //         nrf_delay_ms(250);
    //         LED_Off(LED_RGB);
    //         nrf_delay_ms(250);
    //         nrf_drv_wdt_channel_feed(m_channel_id);
    //     }
    //     nrf_delay_ms(2000);
    //     nrf_drv_wdt_channel_feed(m_channel_id);
    // }
		//
		//
    // // On assert, the system can only recover with a reset.
    // NVIC_SystemReset();
}

uint32_t OTA_FlashAddress()
{
    return FLASH_FW_ADDRESS;
}

#define FLASH_MAX_SIZE          (int32_t)(FLASH_STORAGE_ADDRESS - FLASH_FW_ADDRESS)

uint32_t OTA_FlashLength()
{
    return FLASH_MAX_SIZE;
}

uint16_t FLASH_GetDeviceInt(void)
{
    uint8_t byte1 = sFLASH_ReadSingleByte(FLASH_DEVICE_INT);
    uint8_t byte2 = sFLASH_ReadSingleByte(FLASH_DEVICE_INT+0x01);

    return (byte1 << 8)  |  byte2;
}

void FLASH_Begin(uint32_t sFLASH_Address, uint32_t fileSize)
{
    //OTA_FLASHED_Status_SysFlag = 0x0000;
    //Save_SystemFlags();
    for (int i=1; i<APP_TIMER_MAX_TIMERS; i++) app_timer_stop(i);

#if PLATFORM_ID==269
    disconnect_all_peripherals();
#endif
    isCloudUpdating = true;

    Flash_Update_Index = 0;
    External_Flash_Start_Address = sFLASH_Address;
    External_Flash_Address = External_Flash_Start_Address;

    /* Define the number of External Flash pages to be erased */
    NbrOfPage = FLASH_PagesMask(fileSize);

    /* Erase the SPI Flash pages */
    for (uint32_t EraseCounter = 0; (EraseCounter < NbrOfPage); EraseCounter++)
    {
        sFLASH_EraseSector(External_Flash_Start_Address + (sFLASH_PAGESIZE * EraseCounter));
    }
}

uint32_t FLASH_PagesMask(uint32_t fileSize)
{
    //Calculate the number of flash pages that needs to be erased
    uint32_t numPages = 0x0;

    if ((fileSize % sFLASH_PAGESIZE) != 0)
    {
        numPages = (fileSize / sFLASH_PAGESIZE) + 1;
    }
    else
    {
        numPages = fileSize / sFLASH_PAGESIZE;
    }

    return numPages;
}

uint16_t FLASH_Update(const uint8_t *pBuffer, uint32_t address, uint32_t bufferSize)
{
    const uint8_t *writeBuffer = pBuffer;
    uint8_t readBuffer[bufferSize];

    /* Write Data Buffer to SPI Flash memory */
    sFLASH_WriteBuffer(writeBuffer, address, bufferSize);

    /* Read Data Buffer from SPI Flash memory */
    sFLASH_ReadBuffer(readBuffer, address, bufferSize);

    /* Is the Data Buffer successfully programmed to SPI Flash memory */
    if (0 == memcmp(writeBuffer, readBuffer, bufferSize))
    {
        External_Flash_Address += bufferSize;
        Flash_Update_Index += 1;
    }
    else
    {
        /* Erase the problematic SPI Flash pages and back off the chunk index */
        External_Flash_Address = ((uint32_t)(External_Flash_Address / sFLASH_PAGESIZE)) * sFLASH_PAGESIZE;
        sFLASH_EraseSector(External_Flash_Address);
        Flash_Update_Index = (uint16_t)((External_Flash_Address - External_Flash_Start_Address) / bufferSize);
    }
    return Flash_Update_Index;
}

void FLASH_End(void)
{
    const module_info_t* module_info = FLASH_ModuleInfo(FLASH_SERIAL, FLASH_FW_ADDRESS);

