Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/hw_config.c
    if (module_info != NULL) {
        uint32_t fw_len = (uint32_t)(External_Flash_Address - External_Flash_Start_Address);
        if (module_info->module_function==MODULE_FUNCTION_BOOTLOADER) {
            FLASH_CopyFW(FLASH_FW_ADDRESS, fw_len, false, true);
        } else {
            //erase the sector for now, so we can store the FW size and set the flag
            sFLASH_EraseSector(FLASH_FW_STATUS);

            uint8_t length1 = (uint8_t)((fw_len & 0xFF0000) >> 16);
            uint8_t length2 = (uint8_t)((fw_len & 0xFF00) >> 8);
            uint8_t length3 = (uint8_t)(fw_len & 0xFF);


            //TO DO: Set a flag in external flash to notify bootloader there is a FW update
            sFLASH_WriteSingleByte(FLASH_FW_STATUS, 0x01);
            sFLASH_WriteSingleByte(FLASH_FW_LENGTH1, length1);
            sFLASH_WriteSingleByte(FLASH_FW_LENGTH2, length2);
            sFLASH_WriteSingleByte(FLASH_FW_LENGTH3, length3);
        }
        //reboot
        NVIC_SystemReset();
    }
}

void system_init()
{
    system_connection_interval = 0;
}

//HW Init Functions
void leds_init(void)
{
    nrf_gpio_cfg_output(RGB_LED_PIN_RED);
    nrf_gpio_cfg_output(RGB_LED_PIN_GREEN);
    nrf_gpio_cfg_output(RGB_LED_PIN_BLUE);

    nrf_gpio_pin_set(RGB_LED_PIN_RED);
    nrf_gpio_pin_set(RGB_LED_PIN_GREEN);
    nrf_gpio_pin_set(RGB_LED_PIN_BLUE);

    nrf_gpio_cfg_output(0);
    nrf_gpio_pin_clear(0);
}
void timers_init(void)
{
      uint32_t err_code;
    // Initialize timer module, making it NOT use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
    err_code = app_timer_create(&millis_timer, APP_TIMER_MODE_REPEATED, millis_timer_timeout);
    APP_ERROR_CHECK(err_code);

    //start a Timer for uSec resolution
    //TO DO - Do we want this? It keeps the HFCLK running which crushes battery life. Current implentation uses LFCLK
//    micros_timer.p_reg = NRF_TIMER1;
//    micros_timer.irq = TIMER1_IRQn;
//    micros_timer.instance_id = TIMER1_INSTANCE_INDEX;
//
//    err_code = nrf_drv_timer_init(&micros_timer, NULL, micros_timer_timeout);
//    APP_ERROR_CHECK(err_code);
//
//    uint32_t time_ticks =  nrf_drv_timer_us_to_ticks(&micros_timer, 100);
//    DEBUG("System Ticks per millisecond: %d", time_ticks);
//
//    nrf_drv_timer_extended_compare(
//                                   &micros_timer, NRF_TIMER_CC_CHANNEL1, time_ticks, NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, true);
//    nrf_drv_timer_enable(&micros_timer);
}
void gpiote_init(void)
{
    //Commented out when moved to SDK 9.0, which moces away from app_gpiote to nrf_drv_gpiote
    //Do we need to do anything anymore?
//    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}
void buttons_init(void)
{
    //When upgrading to SDK9.0, we disabled APP_GPIOTE, on which this depends. Not sure we need it, so removing it for now.
//    static app_button_cfg_t buttons[] =
//    {
//        {BOARD_BUTTON, false, BUTTON_PULL, button_event_handler}
//    };
//
//    APP_BUTTON_INIT(buttons, sizeof(buttons) / sizeof(buttons[0]), BUTTON_DETECTION_DELAY, true);
}

void external_flash_init(void)
{
    sFLASH_Init();
}

/**@brief Function for the Event Scheduler initialization.
 */
void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

void wdt_init(void)
{
    //Configure WDT.
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    uint32_t err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();
}

void wtd_feed(void)
{
    nrf_drv_wdt_channel_feed(m_channel_id);
}

/**@brief Function for the Device Manager initialization.
 */
void device_manager_init(void)
{
    uint32_t                err_code;
    dm_init_param_t         init_data;
    dm_application_param_t  register_param;
    bool                		bonds_delete = false;

    // Initialize peer device handle.
    err_code = dm_handle_initialize(&m_bonded_peer_handle);
    APP_ERROR_CHECK(err_code);

		//blink(1);

		// char msg[64];
		//
  	// snprintf(msg, 64, "device_manager_init - A - code = 0x%08X\n", (int)err_code);
  	// debugHelper(msg);

		// Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

		// snprintf(msg, 64, "device_manager_init - B - code = 0x%08X\n", (int)err_code);
  	// debugHelper(msg);

		//blink(2);

		// Clear all bonded centrals if the "delete all bonds" button is pushed.
    //SO STUPID! Youmust hand the index of the button from the Init call data structure, not just the pin number
    //It is 8 by the way
//    err_code = app_button_is_pushed(8, &bonds_delete);
//    APP_ERROR_CHECK(err_code);

		//    blink(3);
    init_data.clear_persistent_data = bonds_delete;

    err_code = dm_init(&init_data);
    APP_ERROR_CHECK(err_code);

		// snprintf(msg, 64, "device_manager_init - C - code = 0x%08X\n", (int)err_code);
  	// debugHelper(msg);

		//blink(4);

		memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    // register_param.sec_param.bond         = 0;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;

    //platofrm specific settings
#if PLATFORM_ID==103
    //bluz
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;
#endif
#if PLATFORM_ID==269
    //bluz-gw
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_CLI_ID;
		register_param.sec_param.kdist_periph.enc = 1;
    register_param.sec_param.kdist_periph.id  = 1;

		// snprintf(msg, 64, "device_manager_init - D \n");
  	// debugHelper(msg);
#endif

