Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/hw_config.c
    err_code = dm_register(&m_app_handle, &register_param);

    //blink(5);

		// snprintf(msg, 64, "device_manager_init - E - code = 0x%08X\n", (int)err_code);
  	// debugHelper(msg);

		APP_ERROR_CHECK(err_code);
}

char* DEVICE_NAME = "Bluz DK";
void set_advertised_name(char* name)
{
    DEVICE_NAME = name;
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Connection Parameters module.
 */
void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = NULL;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

uint32_t timers_start(void)
{
    return app_timer_start(millis_timer, TIME_KEPPER_INTERVAL, NULL);
}

uint32_t timers_stop(void)
{
    return app_timer_stop(millis_timer);
}

int register_radio_callback(void (*radio_callback)(bool radio_active))
{
    return ble_radio_notification_init(NRF_APP_PRIORITY_LOW,NRF_RADIO_NOTIFICATION_DISTANCE_800US,radio_callback);
}

void register_data_callback(void (*data_callback)(uint8_t *data, uint16_t length))
{
    customDataServiceRegisterCallback(data_callback);
}

void register_event_callback(void (*event_callback)(uint8_t event, uint8_t *data, uint16_t length))
{
    infoDataServiceRegisterCallback(event_callback);
}

void send_data(uint8_t *data, uint16_t length)
{
    customDataServiceSendData(data, length);
}

void setTxPower(int power)
{
    sd_ble_gap_tx_power_set(power);
}

void setConnParameters(int minimum, int maximum)
{
    ble_disconnect();
    int err_code;
    ble_gap_conn_params_t   gap_conn_params;
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MSEC_TO_UNITS(minimum, UNIT_1_25_MS);
    gap_conn_params.max_conn_interval = MSEC_TO_UNITS(maximum, UNIT_1_25_MS);
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
void ble_stack_init(void)
{
    //Need a new init procedure for SD7
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);

		// upgrade to support BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE as per https://devzone.nordicsemi.com/question/94600/ble_gap_sec_status_auth_req-event_result-in-dm_evt_security_setup_complete/?answer=95512#post-id-95512
		ble_gap_addr_t local_address;
		local_address.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;

		err_code = sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_AUTO, &local_address);
		APP_ERROR_CHECK(err_code);

    // Enable BLE stack

    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
void services_init(void)
{
    uint32_t err_code;
    scs_init_t init;

    init.data_write_handler = data_write_handler;

    err_code = scs_init(&m_scs, &init);
    APP_ERROR_CHECK(err_code);
}

void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    ble_uuid_t adv_uuids[] = {{BLE_SCS_UUID_SERVICE, m_scs.uuid_type}};

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_set(&advdata, &scanrsp);
    APP_ERROR_CHECK(err_code);
}

//Startup Functions

/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t             err_code;

    if (state != BLE_ADVERTISING) {
        ble_gap_adv_params_t adv_params;

        // Start advertising
        memset(&adv_params, 0, sizeof(adv_params));

        adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
        adv_params.p_peer_addr = NULL;
        adv_params.fp          = BLE_GAP_ADV_FP_ANY;
        adv_params.interval    = APP_ADV_INTERVAL;
        adv_params.timeout     = APP_ADV_NO_TIMEOUT;

        err_code = sd_ble_gap_adv_start(&adv_params);
        APP_ERROR_CHECK(err_code);
        state = BLE_ADVERTISING;
    }
}

